english/sentence.org
#+OPTIONS: toc:1 ^:nil ~:nil num:nil reveal_title_slide:nil timestamp:nil

* You can't live your life according to maybes

* Talent indeed makes a people shine, but hard work does too

* Time is a great teacher, but unfortunatly it kills all its pupils.
[[https://youglish.com/getbyid/6808171/unfortunately/english][unfortunatly]]
[[https://youglish.com/getbyid/32048681/pupil/english][pupils]]

* You can't have your cake and eat it.
鱼和熊掌不可兼得.

* A little knowledge is a dangerous thing.
一知半解害死人.

* I have always felt that tragedy and comedy are two sides of the coin. Love and hate are the opposite of the same coin.
塞翁失马焉知非福.