english/sentence.md

# Table of Contents

-   [You can't live your life according to maybes](#orgfafd460)
-   [Talent indeed makes a people shine, but hard work does too](#org4e04a51)
-   [Time is a great teacher, but unfortunatly it kills all its pupils.](#org60fdfaa)
-   [You can't have your cake and eat it.](#org6adcffd)
-   [A little knowledge is a dangerous thing.](#orgbf300f1)
-   [I have always felt that tragedy and comedy are two sides of the coin. Love and hate are the opposite of the same coin.](#orgd5010f5)



<a id="orgfafd460"></a>

# You can't live your life according to maybes


<a id="org4e04a51"></a>

# Talent indeed makes a people shine, but hard work does too


<a id="org60fdfaa"></a>

# Time is a great teacher, but unfortunatly it kills all its pupils.

[unfortunatly](https://youglish.com/getbyid/6808171/unfortunately/english)
[pupils](https://youglish.com/getbyid/32048681/pupil/english)


<a id="org6adcffd"></a>

# You can't have your cake and eat it.

鱼和熊掌不可兼得.


<a id="orgbf300f1"></a>

# A little knowledge is a dangerous thing.

一知半解害死人.


<a id="orgd5010f5"></a>

# I have always felt that tragedy and comedy are two sides of the coin. Love and hate are the opposite of the same coin.

塞翁失马焉知非福.

